# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd 
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [6]:
s1 = pd.Series(np.random.randint(low=1,high=5,size=100))
s2 = pd.Series(np.random.randint(low=1,high=4,size=100))
s3 = pd.Series(np.random.randint(low=10000,high=30001,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [8]:
df = pd.concat([s1,s2,s3],axis=1)

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [9]:
df.columns = ['bedrs','bathrs','price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       4       3            22903
1       3       2            14603
2       2       3            17478
3       2       3            24696
4       1       1            29889
..    ...     ...              ...
95      2       1            15082
96      1       1            13607
97      1       3            25073
98      1       1            18845
99      3       2            23730

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [14]:
bigcol = pd.DataFrame(pd.concat([s1,s2,s3],axis=0))

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [15]:
bigcol

        0
0       4
1       3
2       2
3       2
4       1
..    ...
95  15082
96  13607
97  25073
98  18845
99  23730

[300 rows x 1 columns]

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [21]:
bigcol.reset_index().drop('index',axis=1)

         0
0        4
1        3
2        2
3        2
4        1
..     ...
295  15082
296  13607
297  25073
298  18845
299  23730

[300 rows x 1 columns]